###################################################################

# Created by write_sdc on Fri Jan 14 18:07:42 2022

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
create_clock [get_ports clk]  -name CLK  -period 6  -waveform {0 3}
group_path -name input_group  -from [list [get_ports clk] [get_ports nreset] [get_ports en_de] [get_ports   \
data_rdy] [get_ports key_rdy] [get_ports {data_in[127]}] [get_ports            \
{data_in[126]}] [get_ports {data_in[125]}] [get_ports {data_in[124]}]          \
[get_ports {data_in[123]}] [get_ports {data_in[122]}] [get_ports               \
{data_in[121]}] [get_ports {data_in[120]}] [get_ports {data_in[119]}]          \
[get_ports {data_in[118]}] [get_ports {data_in[117]}] [get_ports               \
{data_in[116]}] [get_ports {data_in[115]}] [get_ports {data_in[114]}]          \
[get_ports {data_in[113]}] [get_ports {data_in[112]}] [get_ports               \
{data_in[111]}] [get_ports {data_in[110]}] [get_ports {data_in[109]}]          \
[get_ports {data_in[108]}] [get_ports {data_in[107]}] [get_ports               \
{data_in[106]}] [get_ports {data_in[105]}] [get_ports {data_in[104]}]          \
[get_ports {data_in[103]}] [get_ports {data_in[102]}] [get_ports               \
{data_in[101]}] [get_ports {data_in[100]}] [get_ports {data_in[99]}]           \
[get_ports {data_in[98]}] [get_ports {data_in[97]}] [get_ports {data_in[96]}]  \
[get_ports {data_in[95]}] [get_ports {data_in[94]}] [get_ports {data_in[93]}]  \
[get_ports {data_in[92]}] [get_ports {data_in[91]}] [get_ports {data_in[90]}]  \
[get_ports {data_in[89]}] [get_ports {data_in[88]}] [get_ports {data_in[87]}]  \
[get_ports {data_in[86]}] [get_ports {data_in[85]}] [get_ports {data_in[84]}]  \
[get_ports {data_in[83]}] [get_ports {data_in[82]}] [get_ports {data_in[81]}]  \
[get_ports {data_in[80]}] [get_ports {data_in[79]}] [get_ports {data_in[78]}]  \
[get_ports {data_in[77]}] [get_ports {data_in[76]}] [get_ports {data_in[75]}]  \
[get_ports {data_in[74]}] [get_ports {data_in[73]}] [get_ports {data_in[72]}]  \
[get_ports {data_in[71]}] [get_ports {data_in[70]}] [get_ports {data_in[69]}]  \
[get_ports {data_in[68]}] [get_ports {data_in[67]}] [get_ports {data_in[66]}]  \
[get_ports {data_in[65]}] [get_ports {data_in[64]}] [get_ports {data_in[63]}]  \
[get_ports {data_in[62]}] [get_ports {data_in[61]}] [get_ports {data_in[60]}]  \
[get_ports {data_in[59]}] [get_ports {data_in[58]}] [get_ports {data_in[57]}]  \
[get_ports {data_in[56]}] [get_ports {data_in[55]}] [get_ports {data_in[54]}]  \
[get_ports {data_in[53]}] [get_ports {data_in[52]}] [get_ports {data_in[51]}]  \
[get_ports {data_in[50]}] [get_ports {data_in[49]}] [get_ports {data_in[48]}]  \
[get_ports {data_in[47]}] [get_ports {data_in[46]}] [get_ports {data_in[45]}]  \
[get_ports {data_in[44]}] [get_ports {data_in[43]}] [get_ports {data_in[42]}]  \
[get_ports {data_in[41]}] [get_ports {data_in[40]}] [get_ports {data_in[39]}]  \
[get_ports {data_in[38]}] [get_ports {data_in[37]}] [get_ports {data_in[36]}]  \
[get_ports {data_in[35]}] [get_ports {data_in[34]}] [get_ports {data_in[33]}]  \
[get_ports {data_in[32]}] [get_ports {data_in[31]}] [get_ports {data_in[30]}]  \
[get_ports {data_in[29]}] [get_ports {data_in[28]}] [get_ports {data_in[27]}]  \
[get_ports {data_in[26]}] [get_ports {data_in[25]}] [get_ports {data_in[24]}]  \
[get_ports {data_in[23]}] [get_ports {data_in[22]}] [get_ports {data_in[21]}]  \
[get_ports {data_in[20]}] [get_ports {data_in[19]}] [get_ports {data_in[18]}]  \
[get_ports {data_in[17]}] [get_ports {data_in[16]}] [get_ports {data_in[15]}]  \
[get_ports {data_in[14]}] [get_ports {data_in[13]}] [get_ports {data_in[12]}]  \
[get_ports {data_in[11]}] [get_ports {data_in[10]}] [get_ports {data_in[9]}]   \
[get_ports {data_in[8]}] [get_ports {data_in[7]}] [get_ports {data_in[6]}]     \
[get_ports {data_in[5]}] [get_ports {data_in[4]}] [get_ports {data_in[3]}]     \
[get_ports {data_in[2]}] [get_ports {data_in[1]}] [get_ports {data_in[0]}]     \
[get_ports {key_in[127]}] [get_ports {key_in[126]}] [get_ports {key_in[125]}]  \
[get_ports {key_in[124]}] [get_ports {key_in[123]}] [get_ports {key_in[122]}]  \
[get_ports {key_in[121]}] [get_ports {key_in[120]}] [get_ports {key_in[119]}]  \
[get_ports {key_in[118]}] [get_ports {key_in[117]}] [get_ports {key_in[116]}]  \
[get_ports {key_in[115]}] [get_ports {key_in[114]}] [get_ports {key_in[113]}]  \
[get_ports {key_in[112]}] [get_ports {key_in[111]}] [get_ports {key_in[110]}]  \
[get_ports {key_in[109]}] [get_ports {key_in[108]}] [get_ports {key_in[107]}]  \
[get_ports {key_in[106]}] [get_ports {key_in[105]}] [get_ports {key_in[104]}]  \
[get_ports {key_in[103]}] [get_ports {key_in[102]}] [get_ports {key_in[101]}]  \
[get_ports {key_in[100]}] [get_ports {key_in[99]}] [get_ports {key_in[98]}]    \
[get_ports {key_in[97]}] [get_ports {key_in[96]}] [get_ports {key_in[95]}]     \
[get_ports {key_in[94]}] [get_ports {key_in[93]}] [get_ports {key_in[92]}]     \
[get_ports {key_in[91]}] [get_ports {key_in[90]}] [get_ports {key_in[89]}]     \
[get_ports {key_in[88]}] [get_ports {key_in[87]}] [get_ports {key_in[86]}]     \
[get_ports {key_in[85]}] [get_ports {key_in[84]}] [get_ports {key_in[83]}]     \
[get_ports {key_in[82]}] [get_ports {key_in[81]}] [get_ports {key_in[80]}]     \
[get_ports {key_in[79]}] [get_ports {key_in[78]}] [get_ports {key_in[77]}]     \
[get_ports {key_in[76]}] [get_ports {key_in[75]}] [get_ports {key_in[74]}]     \
[get_ports {key_in[73]}] [get_ports {key_in[72]}] [get_ports {key_in[71]}]     \
[get_ports {key_in[70]}] [get_ports {key_in[69]}] [get_ports {key_in[68]}]     \
[get_ports {key_in[67]}] [get_ports {key_in[66]}] [get_ports {key_in[65]}]     \
[get_ports {key_in[64]}] [get_ports {key_in[63]}] [get_ports {key_in[62]}]     \
[get_ports {key_in[61]}] [get_ports {key_in[60]}] [get_ports {key_in[59]}]     \
[get_ports {key_in[58]}] [get_ports {key_in[57]}] [get_ports {key_in[56]}]     \
[get_ports {key_in[55]}] [get_ports {key_in[54]}] [get_ports {key_in[53]}]     \
[get_ports {key_in[52]}] [get_ports {key_in[51]}] [get_ports {key_in[50]}]     \
[get_ports {key_in[49]}] [get_ports {key_in[48]}] [get_ports {key_in[47]}]     \
[get_ports {key_in[46]}] [get_ports {key_in[45]}] [get_ports {key_in[44]}]     \
[get_ports {key_in[43]}] [get_ports {key_in[42]}] [get_ports {key_in[41]}]     \
[get_ports {key_in[40]}] [get_ports {key_in[39]}] [get_ports {key_in[38]}]     \
[get_ports {key_in[37]}] [get_ports {key_in[36]}] [get_ports {key_in[35]}]     \
[get_ports {key_in[34]}] [get_ports {key_in[33]}] [get_ports {key_in[32]}]     \
[get_ports {key_in[31]}] [get_ports {key_in[30]}] [get_ports {key_in[29]}]     \
[get_ports {key_in[28]}] [get_ports {key_in[27]}] [get_ports {key_in[26]}]     \
[get_ports {key_in[25]}] [get_ports {key_in[24]}] [get_ports {key_in[23]}]     \
[get_ports {key_in[22]}] [get_ports {key_in[21]}] [get_ports {key_in[20]}]     \
[get_ports {key_in[19]}] [get_ports {key_in[18]}] [get_ports {key_in[17]}]     \
[get_ports {key_in[16]}] [get_ports {key_in[15]}] [get_ports {key_in[14]}]     \
[get_ports {key_in[13]}] [get_ports {key_in[12]}] [get_ports {key_in[11]}]     \
[get_ports {key_in[10]}] [get_ports {key_in[9]}] [get_ports {key_in[8]}]       \
[get_ports {key_in[7]}] [get_ports {key_in[6]}] [get_ports {key_in[5]}]        \
[get_ports {key_in[4]}] [get_ports {key_in[3]}] [get_ports {key_in[2]}]        \
[get_ports {key_in[1]}] [get_ports {key_in[0]}]]
group_path -name output_group  -to [list [get_ports {data_out[127]}] [get_ports {data_out[126]}] [get_ports  \
{data_out[125]}] [get_ports {data_out[124]}] [get_ports {data_out[123]}]       \
[get_ports {data_out[122]}] [get_ports {data_out[121]}] [get_ports             \
{data_out[120]}] [get_ports {data_out[119]}] [get_ports {data_out[118]}]       \
[get_ports {data_out[117]}] [get_ports {data_out[116]}] [get_ports             \
{data_out[115]}] [get_ports {data_out[114]}] [get_ports {data_out[113]}]       \
[get_ports {data_out[112]}] [get_ports {data_out[111]}] [get_ports             \
{data_out[110]}] [get_ports {data_out[109]}] [get_ports {data_out[108]}]       \
[get_ports {data_out[107]}] [get_ports {data_out[106]}] [get_ports             \
{data_out[105]}] [get_ports {data_out[104]}] [get_ports {data_out[103]}]       \
[get_ports {data_out[102]}] [get_ports {data_out[101]}] [get_ports             \
{data_out[100]}] [get_ports {data_out[99]}] [get_ports {data_out[98]}]         \
[get_ports {data_out[97]}] [get_ports {data_out[96]}] [get_ports               \
{data_out[95]}] [get_ports {data_out[94]}] [get_ports {data_out[93]}]          \
[get_ports {data_out[92]}] [get_ports {data_out[91]}] [get_ports               \
{data_out[90]}] [get_ports {data_out[89]}] [get_ports {data_out[88]}]          \
[get_ports {data_out[87]}] [get_ports {data_out[86]}] [get_ports               \
{data_out[85]}] [get_ports {data_out[84]}] [get_ports {data_out[83]}]          \
[get_ports {data_out[82]}] [get_ports {data_out[81]}] [get_ports               \
{data_out[80]}] [get_ports {data_out[79]}] [get_ports {data_out[78]}]          \
[get_ports {data_out[77]}] [get_ports {data_out[76]}] [get_ports               \
{data_out[75]}] [get_ports {data_out[74]}] [get_ports {data_out[73]}]          \
[get_ports {data_out[72]}] [get_ports {data_out[71]}] [get_ports               \
{data_out[70]}] [get_ports {data_out[69]}] [get_ports {data_out[68]}]          \
[get_ports {data_out[67]}] [get_ports {data_out[66]}] [get_ports               \
{data_out[65]}] [get_ports {data_out[64]}] [get_ports {data_out[63]}]          \
[get_ports {data_out[62]}] [get_ports {data_out[61]}] [get_ports               \
{data_out[60]}] [get_ports {data_out[59]}] [get_ports {data_out[58]}]          \
[get_ports {data_out[57]}] [get_ports {data_out[56]}] [get_ports               \
{data_out[55]}] [get_ports {data_out[54]}] [get_ports {data_out[53]}]          \
[get_ports {data_out[52]}] [get_ports {data_out[51]}] [get_ports               \
{data_out[50]}] [get_ports {data_out[49]}] [get_ports {data_out[48]}]          \
[get_ports {data_out[47]}] [get_ports {data_out[46]}] [get_ports               \
{data_out[45]}] [get_ports {data_out[44]}] [get_ports {data_out[43]}]          \
[get_ports {data_out[42]}] [get_ports {data_out[41]}] [get_ports               \
{data_out[40]}] [get_ports {data_out[39]}] [get_ports {data_out[38]}]          \
[get_ports {data_out[37]}] [get_ports {data_out[36]}] [get_ports               \
{data_out[35]}] [get_ports {data_out[34]}] [get_ports {data_out[33]}]          \
[get_ports {data_out[32]}] [get_ports {data_out[31]}] [get_ports               \
{data_out[30]}] [get_ports {data_out[29]}] [get_ports {data_out[28]}]          \
[get_ports {data_out[27]}] [get_ports {data_out[26]}] [get_ports               \
{data_out[25]}] [get_ports {data_out[24]}] [get_ports {data_out[23]}]          \
[get_ports {data_out[22]}] [get_ports {data_out[21]}] [get_ports               \
{data_out[20]}] [get_ports {data_out[19]}] [get_ports {data_out[18]}]          \
[get_ports {data_out[17]}] [get_ports {data_out[16]}] [get_ports               \
{data_out[15]}] [get_ports {data_out[14]}] [get_ports {data_out[13]}]          \
[get_ports {data_out[12]}] [get_ports {data_out[11]}] [get_ports               \
{data_out[10]}] [get_ports {data_out[9]}] [get_ports {data_out[8]}] [get_ports \
{data_out[7]}] [get_ports {data_out[6]}] [get_ports {data_out[5]}] [get_ports  \
{data_out[4]}] [get_ports {data_out[3]}] [get_ports {data_out[2]}] [get_ports  \
{data_out[1]}] [get_ports {data_out[0]}] [get_ports busy] [get_ports           \
data_valid]]
set_input_delay -clock CLK  -max 0.5  [get_ports nreset]
set_input_delay -clock CLK  -min 0  [get_ports nreset]
set_input_delay -clock CLK  -max 0.5  [get_ports en_de]
set_input_delay -clock CLK  -min 0  [get_ports en_de]
set_input_delay -clock CLK  -max 0.5  [get_ports data_rdy]
set_input_delay -clock CLK  -min 0  [get_ports data_rdy]
set_input_delay -clock CLK  -max 0.5  [get_ports key_rdy]
set_input_delay -clock CLK  -min 0  [get_ports key_rdy]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[127]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[127]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[126]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[126]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[125]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[125]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[124]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[124]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[123]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[123]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[122]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[122]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[121]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[121]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[120]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[120]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[119]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[119]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[118]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[118]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[117]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[117]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[116]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[116]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[115]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[115]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[114]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[114]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[113]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[113]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[112]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[112]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[111]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[111]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[110]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[110]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[109]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[109]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[108]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[108]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[107]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[107]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[106]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[106]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[105]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[105]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[104]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[104]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[103]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[103]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[102]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[102]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[101]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[101]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[100]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[100]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[99]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[99]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[98]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[98]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[97]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[97]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[96]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[96]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[95]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[95]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[94]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[94]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[93]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[93]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[92]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[92]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[91]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[91]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[90]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[90]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[89]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[89]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[88]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[88]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[87]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[87]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[86]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[86]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[85]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[85]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[84]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[84]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[83]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[83]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[82]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[82]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[81]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[81]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[80]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[80]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[79]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[79]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[78]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[78]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[77]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[77]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[76]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[76]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[75]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[75]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[74]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[74]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[73]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[73]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[72]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[72]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[71]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[71]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[70]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[70]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[69]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[69]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[68]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[68]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[67]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[67]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[66]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[66]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[65]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[65]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[64]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[64]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[63]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[63]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[62]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[62]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[61]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[61]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[60]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[60]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[59]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[59]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[58]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[58]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[57]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[57]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[56]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[56]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[55]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[55]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[54]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[54]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[53]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[53]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[52]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[52]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[51]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[51]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[50]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[50]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[49]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[49]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[48]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[48]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[47]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[47]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[46]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[46]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[45]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[45]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[44]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[44]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[43]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[43]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[42]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[42]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[41]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[41]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[40]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[40]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[39]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[39]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[38]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[38]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[37]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[37]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[36]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[36]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[35]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[35]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[34]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[34]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[33]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[33]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[32]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[32]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[31]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[31]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[30]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[30]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[29]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[29]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[28]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[28]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[27]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[27]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[26]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[26]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[25]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[25]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[24]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[24]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[23]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[23]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[22]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[22]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[21]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[21]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[20]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[20]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[19]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[19]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[18]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[18]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[17]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[17]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[16]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[16]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[15]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[14]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {data_in[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {data_in[0]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[127]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[127]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[126]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[126]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[125]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[125]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[124]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[124]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[123]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[123]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[122]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[122]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[121]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[121]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[120]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[120]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[119]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[119]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[118]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[118]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[117]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[117]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[116]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[116]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[115]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[115]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[114]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[114]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[113]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[113]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[112]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[112]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[111]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[111]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[110]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[110]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[109]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[109]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[108]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[108]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[107]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[107]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[106]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[106]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[105]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[105]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[104]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[104]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[103]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[103]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[102]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[102]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[101]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[101]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[100]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[100]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[99]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[99]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[98]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[98]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[97]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[97]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[96]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[96]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[95]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[95]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[94]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[94]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[93]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[93]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[92]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[92]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[91]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[91]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[90]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[90]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[89]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[89]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[88]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[88]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[87]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[87]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[86]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[86]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[85]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[85]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[84]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[84]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[83]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[83]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[82]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[82]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[81]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[81]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[80]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[80]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[79]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[79]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[78]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[78]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[77]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[77]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[76]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[76]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[75]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[75]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[74]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[74]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[73]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[73]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[72]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[72]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[71]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[71]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[70]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[70]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[69]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[69]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[68]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[68]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[67]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[67]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[66]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[66]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[65]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[65]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[64]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[64]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[63]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[63]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[62]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[62]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[61]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[61]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[60]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[60]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[59]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[59]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[58]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[58]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[57]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[57]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[56]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[56]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[55]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[55]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[54]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[54]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[53]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[53]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[52]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[52]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[51]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[51]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[50]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[50]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[49]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[49]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[48]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[48]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[47]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[47]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[46]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[46]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[45]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[45]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[44]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[44]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[43]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[43]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[42]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[42]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[41]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[41]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[40]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[40]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[39]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[39]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[38]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[38]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[37]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[37]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[36]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[36]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[35]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[35]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[34]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[34]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[33]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[33]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[32]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[32]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[31]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[31]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[30]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[30]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[29]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[29]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[28]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[28]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[27]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[27]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[26]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[26]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[25]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[25]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[24]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[24]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[23]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[23]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[22]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[22]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[21]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[21]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[20]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[20]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[19]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[19]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[18]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[18]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[17]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[17]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[16]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[16]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[15]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[15]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[14]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[14]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[13]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[13]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[12]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[12]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[11]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[11]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[10]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[10]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[9]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[9]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[8]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[8]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[7]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[7]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[6]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[6]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[5]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[5]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[4]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[4]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[3]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[3]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[2]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[2]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[1]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[1]}]
set_input_delay -clock CLK  -max 0.5  [get_ports {key_in[0]}]
set_input_delay -clock CLK  -min 0  [get_ports {key_in[0]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[127]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[126]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[125]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[124]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[123]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[122]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[121]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[120]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[119]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[118]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[117]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[116]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[115]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[114]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[113]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[112]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[111]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[110]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[109]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[108]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[107]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[106]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[105]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[104]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[103]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[102]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[101]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[100]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[99]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[98]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[97]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[96]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[95]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[94]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[93]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[92]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[91]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[90]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[89]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[88]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[87]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[86]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[85]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[84]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[83]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[82]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[81]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[80]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[79]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[78]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[77]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[76]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[75]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[74]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[73]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[72]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[71]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[70]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[69]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[68]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[67]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[66]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[65]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[64]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[63]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[62]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[61]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[60]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[59]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[58]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[57]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[56]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[55]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[54]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[53]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[52]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[51]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[50]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[49]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[48]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[47]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[46]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[45]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[44]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[43]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[42]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[41]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[40]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[39]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[38]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[37]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[36]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[35]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[34]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[33]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[32]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[31]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[30]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[29]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[28]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[27]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[26]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[25]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[24]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[23]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[22]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[21]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[20]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[19]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[18]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[17]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[16]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[15]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[14]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[13]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[12]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[11]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[10]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[9]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[8]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[7]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[6]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[5]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[4]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[3]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[2]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[1]}]
set_output_delay -clock CLK  0.5  [get_ports {data_out[0]}]
set_output_delay -clock CLK  0.5  [get_ports busy]
set_output_delay -clock CLK  0.5  [get_ports data_valid]
